Revit 2026 API

# ACADVersion Enumeration

---

An enumerated type listing available AutoCAD versions, into which a file may be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ACADVersion
```
```vb
Public Enumeration ACADVersion
```
```cpp
public enum class ACADVersion
```
```fsharp
type ACADVersion
```

| Member name | Value | Description |
| --- | --- | --- |
| Default | 28 | The Autodesk Revit application's default export format. |
| R2007 | 3 | AutoCAD 2007 file format. |
| R2010 | 16 | AutoCAD 2010 file format. |
| R2013 | 22 | AutoCAD 2013 file format. |
| R2018 | 28 | AutoCAD 2018 file format. |

#### Reference

Autodesk.Revit.DB Namespace